# Object creation (2024-01-26)

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.722340  0.917160 -0.373277  0.217395
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-03 -0.692078  1.204050  0.390337  0.196872
2013-01-04  0.565987  0.782382 -0.228497  1.564440
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271
2013-01-06  1.726931  1.043008 -0.042845 -0.082201

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1,index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo", #특이한게 ,로 끝내도 되고 아닌 것으로 끝내도 되네?
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
#df2.<TAB> # noqa: E225, E999

#df2.까지 입력후 탭누르라는 의미, vscode에서는 탭안눌러도 자동으로 표시 단 컬럼은 안 표시됨

# Viewing data (2024-01-27)

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.722340  0.917160 -0.373277  0.217395
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-03 -0.692078  1.204050  0.390337  0.196872
2013-01-04  0.565987  0.782382 -0.228497  1.564440
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.565987  0.782382 -0.228497  1.564440
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271
2013-01-06  1.726931  1.043008 -0.042845 -0.082201

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[ 0.72233998,  0.91716032, -0.37327696,  0.21739472],
       [-0.8940779 , -0.13000223, -0.63197815,  2.47525735],
       [-0.69207802,  1.20405001,  0.39033714,  0.19687209],
       [ 0.56598663,  0.78238243, -0.2284969 ,  1.56443958],
       [-0.7669253 , -0.65556059, -0.63312176,  2.09127135],
       [ 1.72693116,  1.04300772, -0.04284524, -0.08220148]])

In [13]:
df.values

array([[ 0.72233998,  0.91716032, -0.37327696,  0.21739472],
       [-0.8940779 , -0.13000223, -0.63197815,  2.47525735],
       [-0.69207802,  1.20405001,  0.39033714,  0.19687209],
       [ 0.56598663,  0.78238243, -0.2284969 ,  1.56443958],
       [-0.7669253 , -0.65556059, -0.63312176,  2.09127135],
       [ 1.72693116,  1.04300772, -0.04284524, -0.08220148]])

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.110363  0.526840 -0.253230  1.077172
std    1.059986  0.744608  0.390187  1.102612
min   -0.894078 -0.655561 -0.633122 -0.082201
25%   -0.748213  0.098094 -0.567303  0.202003
50%   -0.063046  0.849771 -0.300887  0.890917
75%    0.683252  1.011546 -0.089258  1.959563
max    1.726931  1.204050  0.390337  2.475257

In [18]:
df.T
#행과 열을 바꿔주는데 미리 계산되어 있음
#메소드가 아닌 속성임

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.722340   -0.894078   -0.692078    0.565987   -0.766925    1.726931
B    0.917160   -0.130002    1.204050    0.782382   -0.655561    1.043008
C   -0.373277   -0.631978    0.390337   -0.228497   -0.633122   -0.042845
D    0.217395    2.475257    0.196872    1.564440    2.091271   -0.082201

In [19]:
df.T.index
#값만 바꿔서 나타내는가해서 확인용으로 해줬는데 인덱스도 확실히 바뀌어있다

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.sort_index(axis=1, ascending=False)
#axis = 1 하면 열끼리 정렬하는 것

                   D         C         B         A
2013-01-01  0.217395 -0.373277  0.917160  0.722340
2013-01-02  2.475257 -0.631978 -0.130002 -0.894078
2013-01-03  0.196872  0.390337  1.204050 -0.692078
2013-01-04  1.564440 -0.228497  0.782382  0.565987
2013-01-05  2.091271 -0.633122 -0.655561 -0.766925
2013-01-06 -0.082201 -0.042845  1.043008  1.726931

In [21]:
df.sort_values(by="B")
#df안에 있는 특정 열의 값에 대해서 정렬해줄 수 있음

                   A         B         C         D
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-04  0.565987  0.782382 -0.228497  1.564440
2013-01-01  0.722340  0.917160 -0.373277  0.217395
2013-01-06  1.726931  1.043008 -0.042845 -0.082201
2013-01-03 -0.692078  1.204050  0.390337  0.196872

# Selection (2024-01-28)

## Getitem ([])

In [22]:
df["A"]

2013-01-01    0.722340
2013-01-02   -0.894078
2013-01-03   -0.692078
2013-01-04    0.565987
2013-01-05   -0.766925
2013-01-06    1.726931
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.722340  0.917160 -0.373277  0.217395
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-03 -0.692078  1.204050  0.390337  0.196872

In [24]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-03 -0.692078  1.204050  0.390337  0.196872
2013-01-04  0.565987  0.782382 -0.228497  1.564440

## Selection by label

In [25]:
df.loc[dates[0]]

A    0.722340
B    0.917160
C   -0.373277
D    0.217395
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
df.loc[dates[0],:]

A    0.722340
B    0.917160
C   -0.373277
D    0.217395
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.722340  0.917160
2013-01-02 -0.894078 -0.130002
2013-01-03 -0.692078  1.204050
2013-01-04  0.565987  0.782382
2013-01-05 -0.766925 -0.655561
2013-01-06  1.726931  1.043008

In [28]:
df.loc["20130102":"20130104",["A","B"]]

                   A         B
2013-01-02 -0.894078 -0.130002
2013-01-03 -0.692078  1.204050
2013-01-04  0.565987  0.782382

In [29]:
df.loc["20130102":"20130104",["B","A"]]

                   B         A
2013-01-02 -0.130002 -0.894078
2013-01-03  1.204050 -0.692078
2013-01-04  0.782382  0.565987

In [30]:
df.loc[dates[0],"A"]

0.7223399817466334

In [31]:
df.at[dates[0],"A"]

0.7223399817466334

## Selection by position

In [32]:
df.iloc[3]

A    0.565987
B    0.782382
C   -0.228497
D    1.564440
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.565987  0.782382
2013-01-05 -0.766925 -0.655561

In [34]:
#비교 loc는 슬라이싱 할때 끝부분까지로 인식(끝부분 포함됨) iloc는 끝부분제외
#df.loc[3:5, 0:2] 아 맞다 이런 식으로 숫자 인덱스로 안됬다
df.loc["20130104":"20130105", "A":"B"]

                   A         B
2013-01-04  0.565987  0.782382
2013-01-05 -0.766925 -0.655561

In [35]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.894078 -0.631978
2013-01-03 -0.692078  0.390337
2013-01-05 -0.766925 -0.633122

In [36]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257
2013-01-03 -0.692078  1.204050  0.390337  0.196872

In [37]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.917160 -0.373277
2013-01-02 -0.130002 -0.631978
2013-01-03  1.204050  0.390337
2013-01-04  0.782382 -0.228497
2013-01-05 -0.655561 -0.633122
2013-01-06  1.043008 -0.042845

In [38]:
df.iloc[1,1]

-0.13000222578008944

In [39]:
df.iat[1,1]

-0.13000222578008944

## Boolean indexing (조건에 따른 컬럼 선택)

In [40]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.722340  0.917160 -0.373277  0.217395
2013-01-04  0.565987  0.782382 -0.228497  1.564440
2013-01-06  1.726931  1.043008 -0.042845 -0.082201

In [41]:
df[df>0]

                   A         B         C         D
2013-01-01  0.722340  0.917160       NaN  0.217395
2013-01-02       NaN       NaN       NaN  2.475257
2013-01-03       NaN  1.204050  0.390337  0.196872
2013-01-04  0.565987  0.782382       NaN  1.564440
2013-01-05       NaN       NaN       NaN  2.091271
2013-01-06  1.726931  1.043008       NaN       NaN

In [42]:
df2=df.copy()
df2["E"]=["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.722340  0.917160 -0.373277  0.217395    one
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257    one
2013-01-03 -0.692078  1.204050  0.390337  0.196872    two
2013-01-04  0.565987  0.782382 -0.228497  1.564440  three
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271   four
2013-01-06  1.726931  1.043008 -0.042845 -0.082201  three

In [43]:
df2[df2["E"].isin(["two", "four"])]
#isin()안에 []로 넣어야하는 듯 (한 개의 경우에도)

                   A         B         C         D     E
2013-01-03 -0.692078  1.204050  0.390337  0.196872   two
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271  four

## Setting

In [44]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df["F"]=s1

In [46]:
df.at[dates[0],"A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.917160 -0.373277  0.217395  NaN
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257  1.0
2013-01-03 -0.692078  1.204050  0.390337  0.196872  2.0
2013-01-04  0.565987  0.782382 -0.228497  1.564440  3.0
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271  4.0
2013-01-06  1.726931  1.043008 -0.042845 -0.082201  5.0

In [47]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.373277  0.217395  NaN
2013-01-02 -0.894078 -0.130002 -0.631978  2.475257  1.0
2013-01-03 -0.692078  1.204050  0.390337  0.196872  2.0
2013-01-04  0.565987  0.782382 -0.228497  1.564440  3.0
2013-01-05 -0.766925 -0.655561 -0.633122  2.091271  4.0
2013-01-06  1.726931  1.043008 -0.042845 -0.082201  5.0

In [48]:
len(df)

6

In [49]:
df.loc[:, "D"] = np.array([5]*len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.373277  5.0  NaN
2013-01-02 -0.894078 -0.130002 -0.631978  5.0  1.0
2013-01-03 -0.692078  1.204050  0.390337  5.0  2.0
2013-01-04  0.565987  0.782382 -0.228497  5.0  3.0
2013-01-05 -0.766925 -0.655561 -0.633122  5.0  4.0
2013-01-06  1.726931  1.043008 -0.042845  5.0  5.0

In [50]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.373277 -5.0  NaN
2013-01-02 -0.894078 -0.130002 -0.631978 -5.0 -1.0
2013-01-03 -0.692078 -1.204050 -0.390337 -5.0 -2.0
2013-01-04 -0.565987 -0.782382 -0.228497 -5.0 -3.0
2013-01-05 -0.766925 -0.655561 -0.633122 -5.0 -4.0
2013-01-06 -1.726931 -1.043008 -0.042845 -5.0 -5.0

# Missing data (2024-01-29)

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -0.373277  5.0  NaN NaN
2013-01-02 -0.894078 -0.130002 -0.631978  5.0  1.0 NaN
2013-01-03 -0.692078  1.204050  0.390337  5.0  2.0 NaN
2013-01-04  0.565987  0.782382 -0.228497  5.0  3.0 NaN

In [52]:
df1.dropna(how="any") #결측치 있으면 다 제거하는 옵션인듯?

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [53]:
df1.fillna(value=5) #결측치를 특정 값으로 다 바꿔서 채우는 방법

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.373277  5.0  5.0  5.0
2013-01-02 -0.894078 -0.130002 -0.631978  5.0  1.0  5.0
2013-01-03 -0.692078  1.204050  0.390337  5.0  2.0  5.0
2013-01-04  0.565987  0.782382 -0.228497  5.0  3.0  5.0

In [54]:
pd.isna(df1) #결측치가 있는가에 대한 T/F판단 있으면 T

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

# Operations (2024-01-30)

## Stats

In [55]:
df

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.373277  5.0  NaN  1.0
2013-01-02 -0.894078 -0.130002 -0.631978  5.0  1.0  1.0
2013-01-03 -0.692078  1.204050  0.390337  5.0  2.0  NaN
2013-01-04  0.565987  0.782382 -0.228497  5.0  3.0  NaN
2013-01-05 -0.766925 -0.655561 -0.633122  5.0  4.0  NaN
2013-01-06  1.726931  1.043008 -0.042845  5.0  5.0  NaN

In [56]:
df.mean() #NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯

A   -0.010027
B    0.373980
C   -0.253230
D    5.000000
F    3.000000
E    1.000000
dtype: float64

자동으로 commit되게 yml추가해준 것 테스트용도

In [57]:
print(df.mean(axis=1)) 
# 마찬가지로 NaN값있으면 합산, 갯수에서 제외하고 평균 내는 듯, 단 axis=1이면 행 별로 모든 컬럼의 값의 평균 내줌
# axis = 1말고 그냥 인자로 1만 줘도 동일한 결과가 나오는 듯 함

2013-01-01    1.125345
2013-01-02    0.890657
2013-01-03    1.580462
2013-01-04    1.823974
2013-01-05    1.388878
2013-01-06    2.545419
Freq: D, dtype: float64

In [58]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [59]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Series의 메소드인 shift가 뭐하는 녀석인지 몰라서 문서에 들어가보니 아래와 같이 서술되어있었다   
shift([periods, freq, axis, fill_value, suffix])    
Shift index by desired number of periods with an optional time freq.    
자세한 내용은 모르겠지만 대강 값들을 index를 기준으로 준 값만큼 이동시키는 듯하다   
1일과 2일의 경우 이전 인덱스에 해당하는 데이터가 없으니 NaN로 결측치가 된 것이고    
3,4,5일의 경우 인덱스상으로 2이전의 값들이 존재했으니 해당값들로 바뀌었고   
6일의 경우 인덱스상으로 2이전의 값이 NaN로 결측치 였기에 결측치로 되었는 듯하다.

In [60]:
df.sub(s, axis='index')

                   A         B         C    D    F   E
2013-01-01       NaN       NaN       NaN  NaN  NaN NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN NaN
2013-01-03 -1.692078  0.204050 -0.609663  4.0  1.0 NaN
2013-01-04 -2.434013 -2.217618 -3.228497  2.0  0.0 NaN
2013-01-05 -5.766925 -5.655561 -5.633122  0.0 -1.0 NaN
2013-01-06       NaN       NaN       NaN  NaN  NaN NaN

>https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame
이번엔 df의 메소드인 sub에 대하여 설명이 없어서 찾아보니 아래와 같이 메소드로 설명되어있었고 잘 이해가 되지 않아 좀더 자세한 독스에 들어갔다    
sub(other[, axis, level, fill_value])       
Get Subtraction of dataframe and other, element-wise (binary operator sub).     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub   
DataFrame.sub(other, axis='columns', level=None, fill_value=None)   
대강 구조를 보니 df에 대하여 빼기를 해주는데 sub()안에 들어있는 값으로 빼주는 것으로 들어올 수 있는 other로는 scalar, sequence, Series, dict or DataFrame이 가능하다고 한다 이중 sequence는 정확히 뭔지 모르겠어서 찾아보니     
https://wikidocs.net/84391      
내용을 참고하였다 대강 리스트, 문자열, 튜플 이 세가지 자료형이라고 생각하면 될듯하다    
그리고 axis에 대하여 0 or index , 1 or columns의 옵션이 있는데 기본값은 colunms로 되어있다  
fill_value는 결측치를 만났을 때 특정값으로 바꿔넣어줄 것인지 선택하는 옵션으로 기본값은 none로 되어있다     
level 옵션에 대해서는 잘모르겠다 예제도 한문제 뿐인데 잘 이해가 되지 않는다 대강 멀티인덱스를 사용할 경우에 사용하는 느낌인데 예제를 아래 그대로 가져와서 해보고 이해해보도록 하겠다

### level 예제

In [61]:
level_example_df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
level_example_df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [62]:
level_example_df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
level_example_df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [63]:
print(level_example_df.div(level_example_df_multindex, level=1))
#원래 예제에는 ,fill_value=0으로 결측치 0으로 바꿔주는 옵션이 추가되어있었다
#뭔가 알듯말듯한데 chatGPT를 통해 설명을 들으니 알 것 같았다
#https://chat.openai.com/share/73654015-96b4-4fb3-b6e3-243526afb670

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        NaN      NaN
  pentagon      NaN      NaN
  hexagon       NaN      NaN

## User defined functions

In [64]:
display(df)
print(df.mean(),'\n')
print(df.mean()*5.6)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.373277  5.0  NaN  1.0
2013-01-02 -0.894078 -0.130002 -0.631978  5.0  1.0  1.0
2013-01-03 -0.692078  1.204050  0.390337  5.0  2.0  NaN
2013-01-04  0.565987  0.782382 -0.228497  5.0  3.0  NaN
2013-01-05 -0.766925 -0.655561 -0.633122  5.0  4.0  NaN
2013-01-06  1.726931  1.043008 -0.042845  5.0  5.0  NaN

A   -0.010027
B    0.373980
C   -0.253230
D    5.000000
F    3.000000
E    1.000000
dtype: float64

A    -0.056153
B     2.094286
C    -1.418090
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [65]:
df.agg(lambda x: np.mean(x)*5.6)

A    -0.056153
B     2.094286
C    -1.418090
D    28.000000
F    16.800000
E     5.600000
dtype: float64

In [66]:
df*101.2

                     A           B          C      D      F      E
2013-01-01    0.000000    0.000000 -37.775628  506.0    NaN  101.2
2013-01-02  -90.480684  -13.156225 -63.956189  506.0  101.2  101.2
2013-01-03  -70.038295  121.849861  39.502119  506.0  202.4    NaN
2013-01-04   57.277847   79.177102 -23.123886  506.0  303.6    NaN
2013-01-05  -77.612840  -66.342731 -64.071922  506.0  404.8    NaN
2013-01-06  174.765433  105.552381  -4.335938  506.0  506.0    NaN

In [67]:
df.transform(lambda x: x*101.2)

                     A           B          C      D      F      E
2013-01-01    0.000000    0.000000 -37.775628  506.0    NaN  101.2
2013-01-02  -90.480684  -13.156225 -63.956189  506.0  101.2  101.2
2013-01-03  -70.038295  121.849861  39.502119  506.0  202.4    NaN
2013-01-04   57.277847   79.177102 -23.123886  506.0  303.6    NaN
2013-01-05  -77.612840  -66.342731 -64.071922  506.0  404.8    NaN
2013-01-06  174.765433  105.552381  -4.335938  506.0  506.0    NaN

agg는 대강은 알듯한데 transform은 agg와 뭐가 다른지 모르겠다    
추가로 유사한 것에 apply도 있던 것으로 기억하는데 여기는 왜 빠져있고 차이가 뭔지도 궁금하다     
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg   
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform   
https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-udf-mutation   
chatGPT에게 차이를 물어본 내용:
https://chat.openai.com/share/654feb01-8d50-481e-8c7a-ca160e1e74a4

## Value Counts

In [68]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    3
1    1
2    0
3    5
4    5
5    2
6    6
7    0
8    6
9    3
dtype: int32

In [69]:
s.value_counts()

3    2
0    2
5    2
6    2
1    1
2    1
Name: count, dtype: int64

## String Methods

In [70]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
print(s)
s.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

pandas.Series:
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series     
Vectorized String Methods:
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods

# Merge (2024-01-31)

## Concat

In [71]:
df = pd.DataFrame(np.random.randn(10,4)) 
#np.random.randn(m,n) : 평균0, 표준편차1의 가우시안 표준정규분포 난수를 matrix array(m,n) 생성
df

          0         1         2         3
0  0.009374  0.604585 -0.975949 -1.652267
1 -0.178268  1.323699  0.454378  0.783858
2 -0.129097 -1.981216  0.033462 -0.064711
3 -0.300572 -0.298084  1.533334  0.425948
4 -0.816599  1.045881  0.900105  0.600085
5 -0.130494 -0.178535  0.103331  0.355808
6 -0.358813  0.447145  0.158376  0.055837
7  0.282389 -0.639505  0.211957  0.372335
8  0.839100  0.656102  0.278512  0.331880
9 -2.050097 -1.214565  1.405479 -0.144503

np.random.randn(m,n) https://nittaku.tistory.com/443    
docs : https://numpy.org/doc/stable/reference/random/generated/numpy.random.randn.html

In [73]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.009374  0.604585 -0.975949 -1.652267
 1 -0.178268  1.323699  0.454378  0.783858
 2 -0.129097 -1.981216  0.033462 -0.064711,
           0         1         2         3
 3 -0.300572 -0.298084  1.533334  0.425948
 4 -0.816599  1.045881  0.900105  0.600085
 5 -0.130494 -0.178535  0.103331  0.355808
 6 -0.358813  0.447145  0.158376  0.055837,
           0         1         2         3
 7  0.282389 -0.639505  0.211957  0.372335
 8  0.839100  0.656102  0.278512  0.331880
 9 -2.050097 -1.214565  1.405479 -0.144503]

In [74]:
pd.concat(pieces)

          0         1         2         3
0  0.009374  0.604585 -0.975949 -1.652267
1 -0.178268  1.323699  0.454378  0.783858
2 -0.129097 -1.981216  0.033462 -0.064711
3 -0.300572 -0.298084  1.533334  0.425948
4 -0.816599  1.045881  0.900105  0.600085
5 -0.130494 -0.178535  0.103331  0.355808
6 -0.358813  0.447145  0.158376  0.055837
7  0.282389 -0.639505  0.211957  0.372335
8  0.839100  0.656102  0.278512  0.331880
9 -2.050097 -1.214565  1.405479 -0.144503

## Join

In [79]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [80]:
right

   key  rval
0  foo     4
1  foo     5

In [81]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [83]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [84]:
right

   key  rval
0  foo     4
1  bar     5

In [85]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5